[
    {
        "bookId": 1,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://files.catbox.moe/obe157.png",
        "review": "Set in the racially segregated South, this novel follows Scout Finch as she navigates childhood and the harsh realities of injustice. Her father, Atticus, defends a Black man, Tom Robinson, falsely accused of a crime. Harper Lee masterfully captures the innocence of youth against a backdrop of racial tension. Scout's observations of morality and fairness are profound, reflecting larger societal issues. The novel critiques the prejudice embedded within the legal system and the human heart. Boo Radley, a reclusive neighbor, serves as an enigmatic figure of misunderstood kindness. The trial scenes are gripping and emotional, exposing systemic injustices with devastating clarity. Lee's vivid characters and authentic dialogue bring 1930s Alabama to life. Themes of courage, empathy, and compassion are woven seamlessly into the story. Scout's journey of understanding speaks to universal truths about humanity. Atticus Finch's integrity and wisdom make him a timeless symbol of justice. The book highlights the resilience of marginalized communities and the power of allyship. Through Scout, readers explore the complexities of growing up in a flawed world. The narrative blends humor, warmth, and heartbreak in perfect harmony. Harper Lee’s writing style is as accessible as it is profound, drawing readers in effortlessly. The novel’s exploration of morality and human connection leaves a lasting impact. It forces readers to confront uncomfortable truths about society and themselves. The story’s resolution provides a glimmer of hope without compromising its realism. This enduring classic challenges readers to stand up for what is right, even when it’s difficult. It remains one of the most important works in American literature, teaching lessons of justice and compassion.",
        "summary": "A young girl’s perspective on racial injustice and courage in the Deep South. A timeless tale of morality and empathy.",
        "totalPages": 281,
        "rating": 4.8,
        "category": "Fiction",
        "tags": ["Classic", "Racism", "Justice"],
        "publisher": "J.B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 2,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://files.catbox.moe/5hhtzz.png",
        "review": "1984 is a powerful dystopian novel that presents a chilling vision of a totalitarian world. Orwell introduces readers to Winston Smith, a man trapped in a society where freedom and individuality are crushed. The Party's omnipresent surveillance, propaganda, and manipulation create an oppressive atmosphere. 'Big Brother' becomes a symbol of absolute control, monitoring every aspect of life. The book explores themes of power, truth, and resistance in a bleak future. Winston’s internal struggle to preserve his humanity amidst conformity is deeply moving. His forbidden love affair with Julia adds a personal dimension to the broader societal critique. Orwell's portrayal of Newspeak reveals how language can be weaponized to suppress dissent. The narrative delves into the psychology of fear and submission under authoritarian rule. The concept of doublethink showcases the dangers of cognitive dissonance imposed by propaganda. Orwell's sparse and haunting prose adds to the novel’s intensity. Winston’s journey is both tragic and enlightening, exposing the fragility of resistance. The novel challenges readers to question the role of government and the erosion of privacy. It also serves as a timeless warning about unchecked power in modern societies. The bleak ending underscores the immense difficulty of fighting oppressive systems. The narrative resonates with today’s concerns about surveillance and misinformation. Orwell’s vision of the future remains profoundly relevant, decades after its publication. The book forces readers to confront uncomfortable truths about power and control. It’s a masterpiece that inspires critical thinking and vigilance against tyranny. 1984 continues to be a cornerstone of dystopian literature, serving as both a cautionary tale and a call to action.",
        "summary": "A man’s fight for individuality in a totalitarian world dominated by Big Brother. A chilling warning about unchecked power.",
        "totalPages": 328,
        "rating": 4.7,
        "category": "Dystopian",
        "tags": ["Totalitarianism", "Surveillance", "Freedom"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 3,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://files.catbox.moe/uqpwm2.png",
        "review": "The Great Gatsby captures the essence of the Roaring Twenties, a time of jazz, wealth, and ambition. Jay Gatsby’s love for Daisy Buchanan drives his quest to reinvent himself. Fitzgerald paints a vivid picture of excess and disillusionment in 1920s America. The green light across the bay symbolizes unattainable dreams and the pursuit of happiness. Gatsby’s grand parties reveal the emptiness behind the glamour and decadence. Nick Carraway, the narrator, offers a grounded perspective on the events unfolding. The novel explores themes of love, ambition, betrayal, and the American Dream. Fitzgerald’s lyrical prose elevates the story into a work of art. The relationships between the characters are complex and morally ambiguous. Daisy’s allure and selfishness make her a fascinating yet flawed figure. Gatsby’s tragic end is a commentary on the illusions of wealth and status. The book critiques the class divide and the corruption of the American Dream. Fitzgerald’s imagery and symbolism enrich every aspect of the narrative. The story’s melancholy tone lingers long after the final page. Nick’s reflections on Gatsby reveal the contrast between idealism and reality. The setting, from lavish mansions to the grim Valley of Ashes, enhances the themes. The novel captures the fleeting nature of love and the weight of unfulfilled dreams. It’s a timeless exploration of human desires and the cost of ambition. Fitzgerald’s masterpiece remains as relevant today as when it was first published. The Great Gatsby is a haunting reminder of the fragility of dreams and the inevitability of disillusionment.",
        "summary": "A man’s obsessive pursuit of love and wealth in 1920s America. A critique of the American Dream and its illusions.",
        "totalPages": 180,
        "rating": 4.5,
        "category": "Classic",
        "tags": ["Romance", "Wealth", "Tragedy"],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 4,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://files.catbox.moe/nbc6ht.png",
        "review": "Pride and Prejudice is a witty and romantic tale of love and societal expectations. Elizabeth Bennet’s sharp intelligence and independence make her a captivating protagonist. Mr. Darcy’s transformation from prideful arrogance to genuine humility is heartwarming. Austen explores themes of class, family, and personal growth with humor and grace. The novel critiques the constraints placed on women in 19th-century England. The dynamic between Elizabeth and Darcy is electric and filled with tension. Austen’s clever dialogue brings the characters to life with vivid realism. The relationships between the Bennet sisters add depth to the story. The setting of rural England enhances the charm and elegance of the narrative. The novel’s humor lies in its sharp observations of social norms and hypocrisy. Austen’s storytelling is timeless, blending romance with social commentary. Elizabeth’s refusal to conform to societal expectations is inspiring. Darcy’s grand gesture of helping Elizabeth’s family is a turning point in the story. The characters’ growth and self-awareness drive the narrative to its satisfying conclusion. The book celebrates the power of love to overcome prejudice and pride. Austen’s mastery of language and wit makes the novel endlessly enjoyable. The timeless themes of love and identity continue to resonate with readers. It’s a story of misjudgments, misunderstandings, and eventual self-discovery. Pride and Prejudice is a triumph of character-driven storytelling. This literary classic remains a cornerstone of romantic fiction and social critique.",
        "summary": "A witty love story exploring class, personal growth, and societal expectations. Elizabeth Bennet and Mr. Darcy are unforgettable.",
        "totalPages": 279,
        "rating": 4.9,
        "category": "Romance",
        "tags": ["Love", "Society", "Independence"],
        "publisher": "T. Egerton",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 5,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://files.catbox.moe/9ml2bz.png",
        "review": "The Catcher in the Rye captures the raw emotions and struggles of teenage life. Holden Caulfield, the narrator, grapples with loss, identity, and the complexities of adulthood. His cynicism and sarcasm reflect a deep longing for authenticity in a world he sees as 'phony.' The novel explores themes of alienation, rebellion, and the pain of growing up. Salinger’s prose is sharp, conversational, and deeply engaging. Holden’s interactions with people reveal his vulnerability and search for connection. The symbolism of the 'catcher in the rye' is both poignant and thought-provoking. Salinger’s portrayal of mental health and grief resonates with readers of all ages. The novel critiques societal norms and the expectations placed on young people. Holden’s relationship with his sister Phoebe is a heartwarming highlight. The book’s setting in New York City mirrors Holden’s chaotic emotional state. Salinger’s use of stream-of-consciousness immerses readers in Holden’s mind. The novel captures the universal struggle of finding purpose and belonging. It’s a deeply introspective and emotional journey through adolescence. Holden’s flawed but relatable character makes him unforgettable. The story’s themes of isolation and hope are timeless. The novel remains a cultural touchstone for its honest portrayal of youth. Salinger’s ability to blend humor with profound insight is masterful. The book’s impact lies in its raw depiction of the human condition. It’s a story that speaks to the outsider in all of us. The Catcher in the Rye is a classic that continues to resonate with readers worldwide.",
        "summary": "A rebellious teenager’s journey through alienation and self-discovery. A raw exploration of adolescence and identity.",
        "totalPages": 277,
        "rating": 4.3,
        "category": "Classic",
        "tags": ["Coming-of-age", "Rebellion", "Identity"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 6,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://files.catbox.moe/i9n1r8.png",
        "review": "The Hobbit is an enchanting adventure that introduces readers to Middle-earth. Bilbo Baggins, a reluctant hero, embarks on a journey with a group of dwarves to reclaim their homeland. Tolkien’s vivid descriptions bring the fantastical world to life with rich detail. The novel explores themes of courage, friendship, and self-discovery. Bilbo’s transformation from a timid hobbit to a brave adventurer is inspiring. The journey is filled with memorable encounters, from trolls to the mysterious Gollum. The riddle game between Bilbo and Gollum is a highlight of suspense and wit. Smaug, the dragon, is a formidable and iconic antagonist. Tolkien’s prose is lyrical and immersive, creating a timeless fantasy. The novel’s humor and charm make it accessible to readers of all ages. The landscapes of Middle-earth are beautifully imagined, from the Shire to the Lonely Mountain. The camaraderie among the characters adds depth and warmth to the story. Tolkien’s mastery of world-building is evident in every chapter. The novel’s pacing balances action with moments of reflection. Bilbo’s cleverness and resourcefulness shine throughout his journey. The story’s themes of home and adventure are universal and enduring. The Hobbit serves as a prelude to Tolkien’s epic Lord of the Rings trilogy. Its blend of whimsy and depth makes it a beloved classic. Tolkien’s ability to weave mythology and storytelling is unparalleled. The Hobbit is a tale of bravery, resilience, and the magic of stepping out of one’s comfort zone.",
        "summary": "A hobbit’s unexpected journey to reclaim a lost kingdom. A timeless tale of courage, adventure, and self-discovery.",
        "totalPages": 310,
        "rating": 4.8,
        "category": "Fantasy",
        "tags": ["Adventure", "Fantasy", "Friendship"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
    },
    {
        "bookId": 7,
        "bookName": "Harry Potter and the Sorcerer’s Stone",
        "author": "J.K. Rowling",
        "image": "https://files.catbox.moe/y9094k.png",
        "review": "Harry Potter and the Sorcerer’s Stone introduces readers to the magical world of Hogwarts. Harry, an orphan, discovers he’s a wizard and begins his journey of self-discovery. The novel is a perfect blend of fantasy, friendship, and mystery. Rowling’s world-building is immersive, creating a setting filled with wonder and intrigue. Harry’s friendships with Ron and Hermione form the heart of the story. The magical creatures, spells, and Hogwarts’ traditions captivate readers of all ages. The story explores themes of belonging, bravery, and the fight against evil. Voldemort’s shadow looms over the narrative, adding tension and urgency. Rowling’s writing balances humor with moments of emotional depth. The book’s pacing keeps readers engaged, from the Quidditch matches to the climactic showdown. Dumbledore’s wisdom and guidance make him a standout character. The concept of the Sorcerer’s Stone ties into themes of immortality and greed. Harry’s journey of understanding his past is both heartbreaking and empowering. The novel’s vivid imagery makes it easy to picture every magical detail. Rowling’s characters are relatable, even within a fantastical setting. The book emphasizes the importance of loyalty, courage, and friendship. Harry’s resilience and determination make him an inspiring protagonist. The novel’s ending sets the stage for the rest of the series beautifully. It’s a story that invites readers into a world they’ll never want to leave. Harry Potter and the Sorcerer’s Stone is a modern classic that continues to enchant readers worldwide.",
        "summary": "An orphan discovers he’s a wizard and begins a magical journey. A story of friendship, bravery, and the battle against evil.",
        "totalPages": 309,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": ["Magic", "Friendship", "Adventure"],
        "publisher": "Bloomsbury",
        "yearOfPublishing": 1997
    },
    {
        "bookId": 8,
        "bookName": "The Lord of the Rings: The Fellowship of the Ring",
        "author": "J.R.R. Tolkien",
        "image": "https://files.catbox.moe/jq5xla.png",
        "review": "The Fellowship of the Ring is the first installment in Tolkien’s epic Lord of the Rings trilogy. The novel begins with Frodo Baggins inheriting a mysterious ring that holds immense power. As the One Ring becomes the focus of a dark force, Frodo embarks on a perilous journey to destroy it. The story is filled with remarkable characters, from the brave Aragorn to the wise Gandalf. The novel explores themes of friendship, loyalty, and the corrupting nature of power. Tolkien’s world-building is unparalleled, with Middle-earth becoming a fully realized setting. The rich history of the world is woven into every page, making it feel alive. The journey of the Fellowship is filled with obstacles, each character facing their own internal struggles. The tension between good and evil is palpable, with Sauron’s shadow growing ever stronger. Tolkien’s prose is lush and descriptive, creating a deep emotional connection with readers. The relationships between the members of the Fellowship are complex and layered. Frodo’s resilience and the burden he carries form the emotional core of the story. The novel’s pacing is perfect, blending action, intrigue, and moments of deep reflection. The symbolism of the Ring emphasizes the theme of temptation and corruption. The Fellowship’s trials are both physical and moral, forcing each member to confront their fears. The sense of camaraderie and sacrifice is present throughout the narrative. Tolkien’s use of language and myth adds a timeless quality to the work. The book ends on a cliffhanger, leaving readers eager to continue the journey. The Fellowship of the Ring is a monumental work in fantasy literature, setting the stage for an unforgettable adventure.",
        "summary": "A young hobbit joins a quest to destroy a powerful ring and defeat dark forces. An epic journey filled with danger and camaraderie.",
        "totalPages": 423,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": ["Adventure", "Epic", "Friendship"],
        "publisher": "Allen & Unwin",
        "yearOfPublishing": 1954
    },
    {
        "bookId": 9,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "https://files.catbox.moe/f8i6oy.png",
        "review": "The Alchemist is a philosophical novel about following one’s dreams and listening to one’s heart. Santiago, a young shepherd, embarks on a journey in search of a hidden treasure. Along the way, he learns valuable lessons about the importance of perseverance, faith, and personal growth. Coelho’s writing is simple yet profound, with each page containing wisdom about life’s deeper meaning. Santiago’s journey symbolizes the pursuit of one’s ‘Personal Legend,’ the true purpose in life. The novel beautifully captures the essence of following one’s dreams, no matter the obstacles. The story emphasizes that the universe conspires to help those who are determined to follow their path. Coelho’s exploration of destiny and self-discovery is both inspiring and motivating. The book’s spiritual themes resonate with readers from all walks of life. Santiago’s encounters with characters such as Melchizedek and the Alchemist help guide him toward his ultimate realization. The symbolism of the desert, the journey, and the treasure all contribute to the story’s rich layers. Coelho’s narrative is a blend of adventure and philosophy, making it both entertaining and thought-provoking. The novel speaks to the universal quest for meaning and fulfillment in life. Santiago’s transformation from a naive shepherd to a wise seeker of truth is empowering. The book encourages readers to trust their instincts and never give up on their dreams. The Alchemist is a timeless story that has inspired millions to pursue their own personal journeys. Coelho’s message is clear: the treasure lies not in the destination, but in the journey itself. The novel’s accessibility and spiritual insights make it a global bestseller. It’s a story of hope, transformation, and the pursuit of happiness.",
        "summary": "A shepherd’s quest for treasure leads to profound lessons about life, dreams, and self-discovery. A philosophical tale of personal growth.",
        "totalPages": 208,
        "rating": 4.7,
        "category": "Adventure",
        "tags": ["Inspiration", "Spiritual", "Motivation"],
        "publisher": "HarperOne",
        "yearOfPublishing": 1988
    },
    // img link add 1-9
    {
        "bookId": 10,
        "bookName": "The Girl on the Train",
        "author": "Paula Hawkins",
        "image": "https://example.com/thegirlonthetrain.jpg",
        "review": "The Girl on the Train is a psychological thriller that explores the complexities of memory, identity, and trust. Rachel, the protagonist, is an alcoholic who rides the train every day, observing the lives of others. She becomes entangled in the disappearance of a woman she’s been watching from the train. Hawkins skillfully weaves a narrative of unreliable narrators, with each character hiding secrets. The story explores the destructive effects of addiction, loss, and betrayal. Rachel’s spiral into self-doubt and guilt makes her an unreliable and sympathetic narrator. The novel’s structure, with alternating points of view, keeps readers engaged and guessing. The tension builds gradually as secrets are revealed, leading to a shocking climax. Hawkins’ writing is tight and suspenseful, with twists that keep readers on edge. The book delves into the psychology of its characters, making them feel real and multi-dimensional. The themes of obsession, deception, and memory are explored with depth and complexity. Rachel’s obsession with the woman she saw from the train is both disturbing and relatable. The setting, with its dreary weather and suburban backdrop, adds to the sense of foreboding. The book’s pacing is relentless, creating a sense of urgency as the mystery unfolds. Hawkins’ ability to create a tense, atmospheric mood is remarkable. The novel explores the complexities of relationships, both romantic and platonic. The characters are flawed and deeply human, adding authenticity to the story. The Girl on the Train is a thrilling, page-turning experience that will keep readers up late into the night. The book challenges perceptions of reality and forces readers to question what they believe. The shocking twist at the end is both unexpected and satisfying, cementing the novel as a genre-defining thriller.",
        "summary": "A woman’s obsession with a missing person leads to shocking twists in a gripping psychological thriller about memory and trust.",
        "totalPages": 395,
        "rating": 4.2,
        "category": "Thriller",
        "tags": ["Mystery", "Suspense", "Psychological"],
        "publisher": "Riverhead Books",
        "yearOfPublishing": 2015
    },
    {
        "bookId": 11,
        "bookName": "Sapiens: A Brief History of Humankind",
        "author": "Yuval Noah Harari",
        "image": "https://example.com/sapiens.jpg",
        "review": "Sapiens is a thought-provoking exploration of human history from the emergence of Homo sapiens to the present day. Harari examines how humans have shaped the world and how the world, in turn, has shaped humans. The book traces the cognitive, agricultural, and scientific revolutions that have defined human existence. Harari’s writing is engaging and accessible, making complex ideas understandable. He delves into the history of societies, economies, and religions, challenging conventional views on human development. Sapiens examines the consequences of human progress, questioning whether it has truly made us happier or more fulfilled. The book’s broad scope and interdisciplinary approach make it a compelling read for those interested in history, anthropology, and philosophy. Harari’s insights into capitalism, imperialism, and the environment are both critical and enlightening. The story of human evolution is told not just from a biological perspective but also from a cultural and psychological one. The book examines the role of myths, ideologies, and technologies in shaping human societies. Harari presents a vision of humanity that is both awe-inspiring and humbling. The narrative is peppered with fascinating anecdotes and ideas that challenge the status quo. The book invites readers to reflect on where humanity is headed and what our future might look like. Sapiens is a captivating journey through human history that encourages readers to think critically about our past and future.",
        "summary": "An exploration of human history, from the rise of Homo sapiens to modern civilization. A critical reflection on the impact of progress.",
        "totalPages": 443,
        "rating": 4.6,
        "category": "Non-fiction",
        "tags": ["History", "Anthropology", "Philosophy"],
        "publisher": "Harvill Secker",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 12,
        "bookName": "The Hunger Games",
        "author": "Suzanne Collins",
        "image": "https://example.com/thehungergames.jpg",
        "review": "The Hunger Games is a gripping dystopian novel set in a future where society is divided into districts, and the Capitol rules with an iron fist. Katniss Everdeen volunteers to take her sister’s place in a brutal annual competition where children fight to the death. Collins creates a tense, fast-paced narrative that explores themes of survival, sacrifice, and rebellion. The novel delves into the psychology of violence and its impact on both the victims and the victors. Katniss’s evolution from a reluctant participant to a symbol of resistance is powerful. The book critiques the nature of reality TV, celebrity culture, and societal indifference to violence. The characters are multi-dimensional, with Katniss, Peeta, and Gale each embodying different aspects of loyalty, love, and survival. The world-building is detailed, with the districts’ poverty contrasting starkly with the Capitol’s excess. Collins’ writing is both accessible and thought-provoking, making the dystopian world feel real and immediate. The tension in the arena is palpable, with every moment fraught with danger. The book raises questions about the ethics of entertainment and the morality of power. The relationships between Katniss and her fellow tributes add emotional depth to the story. The Hunger Games is a thrilling and emotionally charged ride that also serves as a powerful social commentary. Collins’ commentary on class division and political oppression resonates with contemporary issues. The book’s pacing keeps readers engaged, never allowing for a dull moment. Katniss’s journey is both harrowing and inspiring, and her story continues in the sequels.",
        "summary": "A young girl fights for survival in a brutal competition in a dystopian future. A story of rebellion, sacrifice, and survival.",
        "totalPages": 374,
        "rating": 4.6,
        "category": "Dystopian",
        "tags": ["Survival", "Rebellion", "Adventure"],
        "publisher": "Scholastic Press",
        "yearOfPublishing": 2008
    }
]

